yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/i2c/inc/rtl_i2c.h
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL_I2C_H
#define RTL_I2C_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "utils/rtl_utils.h"
#if defined (CONFIG_SOC_SERIES_RTL87X2G)
#include "i2c/src/rtl87x2g/rtl_i2c_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3E)
#include "i2c/src/rtl87x3e/rtl_i2c_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3D)
#include "i2c/src/rtl87x3d/rtl_i2c_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL8762J)
#include "i2c/src/rtl87x2j/rtl_i2c_def.h"
#endif

/** \defgroup I2C         I2C
  * \brief
  * \{
  */

/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup I2C_Exported_Constants I2C Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    I2C_Clock_Speed I2C Clock Speed
 * \{
 * \ingroup     I2C_Exported_Constants
 */
#define IS_I2C_CLOCK_SPEED(SPEED) (((SPEED) >= 0x01) && ((SPEED) <= I2C_CLOCK_MAX_SPEED)) //!< Specify the maximum clock speed.

/** End of I2C_Clock_Speed
  * \}
  */

/**
 * \defgroup    I2C_Device_Mode I2C Device Mode
 * \{
 * \ingroup     I2C_Exported_Constants
 */
typedef enum
{
    I2C_DeviveMode_Slave = 0x00,        //!< I2C slave device.
    I2C_DeviveMode_Master = 0x01,       //!< I2C master device.
} I2CDeviceMode_TypeDef;

#define IS_I2C_DEVICE_MODE(MODE) (((MODE) == I2C_DeviveMode_Slave) || ((MODE) == I2C_DeviveMode_Master)) //!< Check if the input parameter is valid.

/** End of I2C_Device_Mode
  * \}
  */

/**
 * \defgroup    I2C_Address_Mode I2C Address Mode
 * \{
 * \ingroup     I2C_Exported_Constants
 */
typedef enum
{
    I2C_AddressMode_7BIT = 0x00,        //!< I2C 7-bit address mode.
    I2C_AddressMode_10BIT = 0x01,       //!< I2C 10-bit address mode.
} I2CAddressMode_TypeDef;

#define IS_I2C_ADDRESS_MODE(ADDR) (((ADDR) == I2C_AddressMode_7BIT) || ((ADDR) == I2C_AddressMode_10BIT)) //!< Check if the input parameter is valid.

/** End of I2C_Address_Mode
  * \}
  */

/**
 * \defgroup    I2C_Send_Command I2C Send Command
 * \{
 * \ingroup     I2C_Exported_Constants
 */
typedef enum
{
    I2C_WRITE_CMD = 0x00,       //!< Data write command.
    I2C_READ_CMD = 0x01,        //!< Data read command.
} I2CSendCommend_TypeDef;

#define IS_I2C_CMD(CMD) (((CMD) == I2C_WRITE_CMD) || ((CMD) == I2C_READ_CMD)) //!< Check if the input parameter is valid.

/** End of I2C_Send_Command
  * \}
  */

/**
 * \defgroup    I2C_GDMA_Transfer_Requests I2C GDMA Transfer Requests
 * \{
 * \ingroup     I2C_Exported_Constants
 */
typedef enum
{
    I2C_GDMAReq_Rx = 0x01,      //!< GDMA transfer receiving request.
    I2C_GDMAReq_Tx = 0x02,      //!< GDMA transfer sending request.
} I2CGdmaTransferRequests_TypeDef;

#define IS_I2C_GDMAREQ(GDMAREQ) (((GDMAREQ) == I2C_GDMAReq_Rx) || ((GDMAREQ) == I2C_GDMAReq_Tx)) //!< Check if the input parameter is valid.

/** End of I2C_GDMA_Transfer_Requests
  * \}
  */

/**
 * \defgroup    I2C_Status I2C Status
 * \{
 * \ingroup     I2C_Exported_Constants
 */
typedef enum
{
    I2C_Success,                    //!< I2C transfer success.
    I2C_ARB_LOST,                   //!< Master has lost arbitration or the slave transmitter has lost arbitration.
    I2C_ABRT_MASTER_DIS,            //!< User tries to initiate a Master operation with the Master mode disabled.
    I2C_ABRT_TXDATA_NOACK,          //!< Master sent data byte(s) following the address, it did not receive an acknowledge from the remote slave. Only for Master.
    I2C_ABRT_10ADDR2_NOACK,         //!< Master is in 10-bit address mode and the second address byte of the 10-bit address was not acknowledged by any slave.
    I2C_ABRT_10ADDR1_NOACK,         //!< Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.
    I2C_ABRT_7B_ADDR_NOACK,         //!< Master is in 7-bit addressing mode and the address sent was not acknowledged by any slave.
    I2C_ERR_TIMEOUT                 //!< I2C transfer time out error.
} I2C_Status;

/** End of I2C_Status
  * \}
  */

/**
 * \defgroup    I2C_Interrupts I2C Interrupts
 * \{
 * \ingroup     I2C_Exported_Constants
 */

#define I2C_INT_MST_ON_HOLD                     BIT13           //!< When Master TX FIFO is empty and no stop bit command is issued, master will hold the SCL low.
#define I2C_INT_GEN_CALL                        BIT11           //!< Set only when a General Call address is received and it is acknowledged.
#define I2C_INT_START_DET                       BIT10           //!< Indicates whether a START or RESTART condition has occurred on the I2C interface regardless of whether I2C is operating in slave or master mode.
#define I2C_INT_STOP_DET                        BIT9            //!< Indicates whether a STOP condition has occurred on the I2C interface regardless of whether I2C is operating in slave or master mode.
#define I2C_INT_ACTIVITY                        BIT8            //!< This bit captures I2C activity and stays set until it is cleared.          
#define I2C_INT_RX_DONE                         BIT7            //!< When the I2C is acting as a slave-transmitter, this bit is set to 1 if the master does not acknowledge a transmitted byte. This occurs on the last byte of the transmission, indicating that the transmission is done.
#define I2C_INT_TX_ABRT                         BIT6            //!< This bit indicates if I2C as an I2C transmitter, is unable to complete the intended actions on the contents of the transmit FIFO.
#define I2C_INT_RD_REQ                          BIT5            //!< This bit is set to 1 when acting as a slave and another I2C master is attempting to read data.
#define I2C_INT_TX_EMPTY                        BIT4            //!< This bit is set to 1 when the transmit buffer is at or below the threshold value set in the IC_TX_TL register.
#define I2C_INT_TX_OVER                         BIT3            //!< Set during transmit if the transmit buffer is filled to TX FIFO depth and the processor attempts to issue another I2C command.
#define I2C_INT_RX_FULL                         BIT2            //!< Set when the receive buffer reaches or goes above the RX_TL threshold in the IC_RX_TL register.
#define I2C_INT_RX_OVER                         BIT1            //!< Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an additional byte is received from an external I2C device.
#define I2C_INT_RX_UNDER                        BIT0            //!< Set if the processor attempts to read the receive buffer when it is empty by reading.

