yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/i2c/inc/rtl_i2c.h
#define I2C_GET_INT(INT)    (((INT) == I2C_INT_GEN_CALL) || ((INT) == I2C_INT_START_DET) || \
                             ((INT) == I2C_INT_STOP_DET) || ((INT) == I2C_INT_ACTIVITY) || \
                             ((INT) == I2C_INT_RX_DONE)  || ((INT) == I2C_INT_TX_ABRT) || \
                             ((INT) == I2C_INT_RD_REQ)   || ((INT) == I2C_INT_TX_EMPTY) || \
                             ((INT) == I2C_INT_TX_OVER)  || ((INT) == I2C_INT_RX_FULL) || \
                             ((INT) == I2C_INT_RX_OVER)  || ((INT) == I2C_INT_RX_UNDER) || ((INT) == I2C_INT_MST_ON_HOLD)) //!< Check if the input parameter is valid.

/** End of I2C_Interrupts
  * \}
  */

/**
 * \defgroup    I2C_Flags I2C Flags
 * \{
 * \ingroup     I2C_Exported_Constants
 */

#define I2C_FLAG_SLV_HOLD_RX_FIFO_FULL          BIT10           //!< The BUS hold in Slave mode due to the RX FIFO being full and an additional byte being received.
#define I2C_FLAG_SLV_HOLD_TX_FIFO_EMPTY         BIT9            //!< The BUS hold in Slave mode for the read request when the TX FIFO is empty.
#define I2C_FLAG_MST_HOLD_RX_FIFO_FULL          BIT8            //!< The BUS hold in Master mode due to Rx FIFO is full and additional byte has been received.
#define I2C_FLAG_MST_HOLD_TX_FIFO_EMPTY         BIT7            //!< The BUS hold when the master holds the bus because of the TX FIFO being empty.
#define I2C_FLAG_SLV_ACTIVITY                   BIT6            //!< Slave FSM activity status.
#define I2C_FLAG_MST_ACTIVITY                   BIT5            //!< Master FSM activity status.
#define I2C_FLAG_RFF                            BIT4            //!< Receive FIFO completely full.
#define I2C_FLAG_RFNE                           BIT3            //!< Receive FIFO not empty.
#define I2C_FLAG_TFE                            BIT2            //!< Transmit FIFO completely empty.
#define I2C_FLAG_TFNF                           BIT1            //!< Transmit FIFO not full.
#define I2C_FLAG_ACTIVITY                       BIT0            //!< I2C activity status.

#define IS_I2C_GET_FLAG(FLAG) (((FLAG) == I2C_FLAG_SLV_HOLD_RX_FIFO_FULL) || ((FLAG) == I2C_FLAG_SLV_HOLD_TX_FIFO_EMPTY) || \
                               ((FLAG) == I2C_FLAG_MST_HOLD_RX_FIFO_FULL) || ((FLAG) == I2C_FLAG_MST_HOLD_TX_FIFO_EMPTY) || \
                               ((FLAG) == I2C_FLAG_SLV_ACTIVITY) || ((FLAG) == I2C_FLAG_MST_ACTIVITY) || \
                               ((FLAG) == I2C_FLAG_RFF) || ((FLAG) == I2C_FLAG_RFNE) || \
                               ((FLAG) == I2C_FLAG_TFE) || ((FLAG) == I2C_FLAG_TFNF) || \
                               ((FLAG) == I2C_FLAG_ACTIVITY)) //!< Check if the input parameter is valid.

/** End of I2C_Flags
  * \}
  */

/**
 * \defgroup    I2C_Transmit_Abort_Source I2C Transmit Abort Source
 * \{
 * \ingroup     I2C_Exported_Constants
 */

#define ABRT_SLVRD_INTX                         BIT15           //!< When the processor side responds to a slave mode request for data to be transmitted to a remote master and user send read command.
#define ABRT_SLV_ARBLOST                        BIT14           //!< Slave lost the bus while transmitting data to a remote master.
#define ABRT_SLVFLUSH_TXFIFO                    BIT13           //!< Slave has received a read command and some data exists in the TX FIFO so the slave issues a TX_ABRT interrupt to flush old data in TX FIFO.
#define ARB_LOST                                BIT12           //!< Master has lost arbitration or the slave transmitter has lost arbitration.
#define ABRT_MASTER_DIS                         BIT11           //!< User tries to initiate a Master operation with the Master mode disabled
#define ABRT_10B_RD_NORSTRT                     BIT10           //!< The restart is disabled and the master sends a read command in 10-bit addressing mode.
#define ABRT_SBYTE_NORSTRT                      BIT9            //!< The restart is disabled and the user is trying to send a START byte.
#define ABRT_HS_NORSTRT                         BIT8            //!< The restart is disabled and the user is trying to use the master to transfer data in high speed mode.
#define ABRT_SBYTE_ACKDET                       BIT7            //!< Master has sent a START Byte and the START Byte was acknowledged (wrong behavior).
#define ABRT_HS_ACKDET                          BIT6            //!< Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior).
#define ABRT_GCALL_READ                         BIT5            //!< Sent a General Call but the user programmed the byte following the General Call to be a read from the bus.
#define ABRT_GCALL_NOACK                        BIT4            //!< Sent a General Call and no slave on the bus acknowledged the General Call.
#define ABRT_TXDATA_NOACK                       BIT3            //!< Master sent data byte(s) following the address, it did not receive an acknowledge from the remote slave.
#define ABRT_10ADDR2_NOACK                      BIT2            //!< Master is in 10-bit address mode and the second address byte of the 10-bit address was not acknowledged by any slave.
#define ABRT_10ADDR1_NOACK                      BIT1            //!< Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.
#define ABRT_7B_ADDR_NOACK                      BIT0            //!< Master is in 7-bit addressing mode and th address sent was not acknowledged by any slave.

#define MS_ALL_ABORT                            (ARB_LOST | ABRT_MASTER_DIS | ABRT_TXDATA_NOACK |\
                                                 ABRT_10ADDR2_NOACK | ABRT_10ADDR1_NOACK | ABRT_7B_ADDR_NOACK) //!< All types of ABORT.

#define IS_I2C_EVENT(EVENT) (((EVENT) == ABRT_SLVRD_INTX) || \
                             ((EVENT) == ABRT_SLV_ARBLOST) || \
                             ((EVENT) == ABRT_SLVFLUSH_TXFIFO) || \
                             ((EVENT) == ARB_LOST) || \
                             ((EVENT) == ABRT_MASTER_DIS) || \
                             ((EVENT) == ABRT_10B_RD_NORSTRT) || \
                             ((EVENT) == ABRT_SBYTE_NORSTRT) || \
                             ((EVENT) == ABRT_HS_NORSTRT) || \
                             ((EVENT) == ABRT_SBYTE_ACKDET) || \
                             ((EVENT) == ABRT_HS_ACKDET) || \
                             ((EVENT) == ABRT_GCALL_READ) || \
                             ((EVENT) == ABRT_GCALL_NOACK) || \
                             ((EVENT) == ABRT_TXDATA_NOACK) || \
                             ((EVENT) == ABRT_10ADDR2_NOACK) || \
                             ((EVENT) == ABRT_10ADDR1_NOACK) || \
                             ((EVENT) == ABRT_7B_ADDR_NOACK)) //!< Check if the input parameter is valid.

/** End of I2C_Transmit_Abort_Source
  * \}
  */

/**
 * \defgroup    I2C_Immediate_Number I2C Immediate Number
 * \{
 * \ingroup     I2C_Exported_Constants
 */

#define I2C_0X10_CMD         BIT8           //!< If the data is ORed with this immediate value, it indicates a master device read command.
#define I2C_0X10_STOP        BIT9           //!< If the data is ORed with this immediate value, it indicates sending a stop bit.

/** End of I2C_Immediate_Number
  * \}
  */

