yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/i2c/inc/rtl_i2c.h
#if (I2C_SUPPORT_RAP_FUNCTION == 1)
/**
 * \defgroup    I2C_Wrapper_Trans_Mode I2C Wrapper Trans Mode
 * \{
 * \ingroup     I2C_Exported_Constants
 */

typedef enum
{
    I2C_WRAPPER_TRANS_MODE_WRITE       = 0,
    I2C_WRAPPER_TRANS_MODE_READ        = 1,
    I2C_WRAPPER_TRANS_MODE_REPEAT_READ = 2,
    I2C_WRAPPER_TRANS_MODE_DMA         = 3,
} I2CWrapperTransMode_TypeDef;

/** End of I2C_Wrapper_Trans_Mode
  * \}
  */

/**
 * \defgroup    I2C_Task I2C Task Number
 * \{
 * \ingroup     I2C_Exported_Constants
 */

typedef enum
{
    I2C_TASK_START = 0,
} I2CTask_TypeDef;

/** End of I2C_Task
  * \}
  */

#endif

/** End of I2C_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         Types
 *============================================================================*/
/** \defgroup I2C_Exported_Types I2C Exported Types
  * \brief
  * \{
  */

/**
 * \brief       I2C Init structure definition.
 *
 * \ingroup     I2C_Exported_Types
 */

typedef struct
{
    uint32_t I2C_Clock;                    /*!< Specify source clock frequency, default 40000000.
                                                This parameter must be set with I2C clock div. */

    uint32_t I2C_ClockSpeed;               /*!< Specify SCK speed on the I2C bus.
                                                This parameter must be set to a value lower than 1MHz. */

    I2CDeviceMode_TypeDef I2C_DeviveMode;  /*!< Specify the I2C devie mode.
                                                This parameter can be a value of \ref I2C_Device_Mode. */

    I2CAddressMode_TypeDef I2C_AddressMode;/*!< Specify the I2C address mode.
                                                This parameter can be a value of \ref I2C_Address_Mode. */

    uint16_t I2C_SlaveAddress;             /*!< Specify the first device own address.
                                                This parameter can be a 7-bit or 10-bit address. */

    FunctionalState
    I2C_Ack;               /*!< Enable or disable the acknowledgement only in slave mode.
                                                This parameter can be a value of ENABLE or DISABLE. */

    uint32_t I2C_TxThresholdLevel;         /*!< Specify the transmit FIFO Threshold to trigger interrupt I2C_INT_TX_EMPTY.
                                                This parameter can be a value less than I2C_TX_FIFO_SIZE.*/

    uint32_t I2C_RxThresholdLevel;         /*!< Specify the receive FIFO Threshold to trigger interrupt I2C_INT_RX_FULL.
                                                This parameter can be a value less than I2C_RX_FIFO_SIZE.*/

    FunctionalState I2C_TxDmaEn;           /*!< Specify the Tx dma mode.
                                                This parameter can be a value of ENABLE or DISABLE. */

    FunctionalState I2C_RxDmaEn;           /*!< Specify the Rx dma mode.
                                                This parameter can be a value of ENABLE or DISABLE. */

    uint8_t  I2C_TxWaterlevel;             /*!< Specify the DMA tx water level.
                                                The best value is I2C Tx fifo depth - Tx GDMA MSize. */

    uint8_t  I2C_RxWaterlevel;             /*!< Specify the DMA rx water level.
                                                The best value is I2C Rx GDMA MSize. */

    uint8_t  I2C_RisingTimeNs;             /*!< Specify the I2C SDA/SCL rising time.
                                                The unit is ns and must be an integer multiple of clock src period. */

} I2C_InitTypeDef;

/** End of GPIO_Exported_Types
  * \}
  */

/*============================================================================*
 *                         Functions
 *============================================================================*/
/** \defgroup I2C_Exported_Functions I2C Exported Functions
  * \brief
  * \{
  */

/**
 * \brief   Deinitialize the I2Cx peripheral registers to their default reset values.
 *
 * \param[in] I2Cx  Select the I2C peripheral. Refer to \ref I2C_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_i2c0_init(void)
 * {
 *     I2C_DeInit(I2C0);
 * }
 * \endcode
 */
void I2C_DeInit(I2C_TypeDef *I2Cx);

/**
 * \brief   Initialize the I2Cx peripheral according to the specified parameters in the I2C_InitStruct.
 *
 * \param[in] I2Cx            Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] I2C_InitStruct  Pointer to a I2C_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_i2c0_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_I2C0, APBPeriph_I2C0_CLOCK, ENABLE);
 *
 *     I2C_InitTypeDef  I2C_InitStruct;
 *     I2C_StructInit(&I2C_InitStruct);
 *
 *     I2C_InitStruct.I2C_ClockSpeed    = 100000;
 *     I2C_InitStruct.I2C_DeviveMode    = I2C_DeviveMode_Master;
 *     I2C_InitStruct.I2C_AddressMode   = I2C_AddressMode_7BIT;
 *     I2C_InitStruct.I2C_SlaveAddress  = STK8321_ADDRESS;
 *     I2C_InitStruct.I2C_Ack           = I2C_Ack_Enable;
 *
 *     I2C_Init(I2C0, &I2C_InitStruct);
 *     I2C_Cmd(I2C0, ENABLE);
 * }
 * \endcode
 */
void I2C_Init(I2C_TypeDef *I2Cx, I2C_InitTypeDef *I2C_InitStruct);

/**
 * \brief  Enable or disable the specified I2C peripheral.
 *
 * \param[in] I2Cx      Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] NewState  New state of the I2Cx peripheral.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the specified I2C peripheral.
 *                      - DISABLE: Disable the specified I2C peripheral.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_i2c0_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_I2C0, APBPeriph_I2C0_CLOCK, ENABLE);
 *
 *     I2C_InitTypeDef  I2C_InitStruct;
 *     I2C_StructInit(&I2C_InitStruct);
 *
 *     I2C_InitStruct.I2C_ClockSpeed    = 100000;
 *     I2C_InitStruct.I2C_DeviveMode    = I2C_DeviveMode_Master;
 *     I2C_InitStruct.I2C_AddressMode   = I2C_AddressMode_7BIT;
 *     I2C_InitStruct.I2C_SlaveAddress  = STK8321_ADDRESS;
 *     I2C_InitStruct.I2C_Ack           = I2C_Ack_Enable;
 *
 *     I2C_Init(I2C0, &I2C_InitStruct);
 *     I2C_Cmd(I2C0, ENABLE);
 * }
 * \endcode
 */
void I2C_Cmd(I2C_TypeDef *I2Cx, FunctionalState NewState);

/**
 * \brief  Enable or disable the specified I2C peripheral.
 *
 * \param[in] I2Cx  Select the I2C peripheral. Refer to \ref I2C_Declaration.
 *
 * \return The status of I2Cx. Refer to \ref I2C_Status.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     I2C_CheckAbortStatus(I2C0);
 * }
 * \endcode
 */
I2C_Status I2C_CheckAbortStatus(I2C_TypeDef *I2Cx);

/**
 * \brief   Fill each I2C_InitStruct member with its default value.
 *
 * \note   The default settings for the I2C_InitStruct member are shown in the following table:
 *         | I2C_InitStruct member | Default value                    |
 *         |:---------------------:|:--------------------------------:|
 *         | I2C_Clock             | 40000000                         |
 *         | I2C_ClockSpeed        | 400000                           |
 *         | I2C_DeviveMode        | \ref I2C_DeviveMode_Master       |
 *         | I2C_AddressMode       | \ref I2C_AddressMode_7BIT        |
 *         | I2C_SlaveAddress      | 0                                |
 *         | I2C_Ack               | ENABLE                           |
 *         | I2C_TxThresholdLevel  | 0                                |
 *         | I2C_RxThresholdLevel  | 0                                |
 *         | I2C_TxDmaEn           | DISABLE                          |
 *         | I2C_RxDmaEn           | DISABLE                          |
 *         | I2C_TxWaterlevel      | 23                               |
 *         | I2C_RxWaterlevel      | 1                                |
 *         | I2C_RisingTimeNs      | 50                               |
 *
 * \param[in] I2C_InitStruct  Pointer to a I2C_InitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_i2c0_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_I2C0, APBPeriph_I2C0_CLOCK, ENABLE);
 *
 *     I2C_InitTypeDef  I2C_InitStruct;
 *     I2C_StructInit(&I2C_InitStruct);
 *
 *     I2C_InitStruct.I2C_ClockSpeed    = 100000;
 *     I2C_InitStruct.I2C_DeviveMode    = I2C_DeviveMode_Master;
 *     I2C_InitStruct.I2C_AddressMode   = I2C_AddressMode_7BIT;
 *     I2C_InitStruct.I2C_SlaveAddress  = STK8321_ADDRESS;
 *     I2C_InitStruct.I2C_Ack           = I2C_Ack_Enable;
 *
 *     I2C_Init(I2C0, &I2C_InitStruct);
 *     I2C_Cmd(I2C0, ENABLE);
 * }
 * \endcode
 */
void I2C_StructInit(I2C_InitTypeDef *I2C_InitStruct);

/**
 * \brief   Send data in master mode through the I2Cx peripheral.
 *
 * \param[in] I2Cx  Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] pBuf  Byte to be transmitted.
 * \param[in] len   Data length to send.
 *
 * \return I2C_Status: The status of I2Cx.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     uint8_t data[10] = {0x01,x0x02,0x03,0x04};
 *     I2C_MasterWrite(I2C0, data, 4);
 * }
 * \endcode
 */
I2C_Status I2C_MasterWrite(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len);

/**
 * \brief   Read data in master mode through the I2Cx peripheral.
 *
 * \param[in] I2Cx   Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] pBuf   Byte to be transmitted.
 * \param[in] len    Data length to send.
 * \param[in] pBuf2  Byte to be transmitted.
 * \param[in] len2   Data length to send.
 *
 * \return I2C status: The status of I2Cx, refer to \ref I2C_Status.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     uint8_t data[10] = {0x01,x0x02,0x03,0x04};
 *     uint8_t data1[10] = {0x01,x0x02,0x03,0x04};
 *     I2C_MasterWriteDevice(I2C0, data, 4, data, 4);
 * }
 * \endcode
 */
I2C_Status I2C_MasterWriteDevice(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len, uint8_t *pbuf2,
                                 uint32_t len2);

/**
 * \brief   Read data in master mode through the I2Cx peripheral.
 *
 * \param[in] I2Cx   Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[out] pBuf  Data buffer to receive data.
 * \param[in] len    Read data length.
 *
 * \return I2C_Status: The status of I2Cx, refer to \ref I2C_Status.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     uint8_t data[10] = {0};
 *     I2C_MasterRead(I2C0, data, 10);
 * }
 * \endcode
 */
I2C_Status I2C_MasterRead(I2C_TypeDef *I2Cx, uint8_t *pBuf, uint16_t len);

/**
 * \brief   Sends data and read data in master mode through the I2Cx peripheral.
 *          Attention:Read data with time out mechanism.
 *
 * \param[in] I2Cx       Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] pWriteBuf  Data buffer to send before read.
 * \param[in] Writelen   Send data length.
 * \param[out] pReadBuf  Data buffer to receive.
 * \param[in] Readlen    Receive data length.
 *
 * \return I2C_Status: The status of I2Cx, refer to \ref I2C_Status.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     uint8_t tx_data[10] = {0x01,x0x02,0x03,0x04};
 *     uint8_t rx_data[10] = {0};
 *     I2C_RepeatRead(I2C0, tx_data, 4, rx_data, 10);
 * }
 * \endcode
 */
I2C_Status I2C_RepeatRead(I2C_TypeDef *I2Cx, uint8_t *pWriteBuf, uint16_t Writelen,
                          uint8_t *pReadBuf, uint16_t Readlen);

/**
 * \brief Mask the specified I2C interrupt.
 *
 * \param[in] I2Cx      Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] I2C_IT    This parameter can be one of the following values, refer to \ref I2C_Interrupts.
 *                      \arg I2C_INT_MST_ON_HOLD: Indicates whether a master is holding the bus.
 *                      \arg I2C_INT_GEN_CALL: Set only when a General Call address is received and it is acknowledged.
 *                      \arg I2C_INT_START_DET: Indicates whether a START or RESTART condition has occurred on the I2C
 *                           interface regardless of whether I2C is operating in slave or master mode.
 *                      \arg I2C_INT_STOP_DET: Indicates whether a STOP condition has occurred on the I2C interface
 *                           regardless of whether I2C is operating in slave or master mode
 *                      \arg I2C_INT_ACTIVITY: This bit captures I2C activity and stays set until it is cleared.
 *                      \arg I2C_INT_RX_DONE: When the I2C is acting as a slave-transmitter, this bit is set to 1 if the
 *                           master does not acknowledge a transmitted byte. This occurs on the last byte of the
 *                           transmission, indicating that the transmission is done.
 *                      \arg I2C_INT_TX_ABRT: This bit indicates if I2C as an I2C transmitter, is unable to complete the
 *                           intended actions on the contents of the transmit FIFO.
 *                      \arg I2C_INT_RD_REQ: This bit is set to 1 when acting as a slave and another I2C master is
 *                           attempting to read data.
 *                      \arg I2C_INT_TX_EMPTY: This bit is set to 1 when the transmit buffer is at or below the threshold
 *                            value set in the IC_TX_TL register.
 *                      \arg I2C_INT_TX_OVER: Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and
 *                           the processor attempts to issue another I2C command.
 *                      \arg I2C_INT_RX_FULL: Set when the receive buffer reaches or goes above the RX_TL threshold in the
 *                           IC_RX_TL register
 *                      \arg I2C_INT_RX_OVER: Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an
 *                           additional byte is received from an external I2C device.
 *                      \arg I2C_INT_RX_UNDER: Set if the processor attempts to read the receive buffer when it is empty by reading.
 * \param[in] NewState  Mask the specified I2C interrupt or not.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Mask the specified I2C interrupt.
 *                      - DISABLE: Unmask the specified I2C interrupt.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     I2C_ClearINTPendingBit(I2C0, I2C_INT_STOP_DET);
 *     I2C_INTConfig(I2C0, I2C_INT_STOP_DET, ENABLE);
 *
 *     NVIC_InitTypeDef NVIC_InitStruct;
 *     NVIC_InitStruct.NVIC_IRQChannel = I2C0_IRQn;
 *     NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
 *     NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
 *     NVIC_Init(&NVIC_InitStruct);
 * }
 * \endcode
 */
void I2C_INTConfig(I2C_TypeDef *I2Cx, uint16_t I2C_IT, FunctionalState NewState);

/**
 * \brief   Clear the specified I2C interrupt pending bit.
 *
 * \param[in] I2Cx    Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] I2C_IT  This parameter can be one of the following values, refer to \ref I2C_Interrupts.
 *                    - I2C_INT_GEN_CALL: Set only when a General Call address is received and it is acknowledged.
 *                    - I2C_INT_START_DET: Indicates whether a START or RESTART condition has occurred on the I2C
 *                      interface regardless of whether I2C is operating in slave or master mode.
 *                    - I2C_INT_STOP_DET: Indicates whether a STOP condition has occurred on the I2C interface regardless
 *                      of whether I2C is operating in slave or master mode
 *                    - I2C_INT_ACTIVITY: This bit captures I2C activity and stays set until it is cleared.
 *                    - I2C_INT_RX_DONE: When the I2C is acting as a slave-transmitter, this bit is set to 1 if the
 *                      master does not acknowledge a transmitted byte. This occurs on the last byte of the
 *                      transmission, indicating that the transmission is done.
 *                    - I2C_INT_TX_ABRT: This bit indicates if I2C as an I2C transmitter, is unable to complete the
 *                      intended actions on the contents of the transmit FIFO.
 *                    - I2C_INT_RD_REQ: This bit is set to 1 when acting as a slave and another I2C master is
 *                      attempting to read data.
 *                    - I2C_INT_TX_EMPTY: This bit is set to 1 when the transmit buffer is at or below the threshold value set
 *                      in the IC_TX_TL register.
 *                    - I2C_INT_TX_OVER: Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and
 *                      the processor attempts to issue another I2C command.
 *                    - I2C_INT_RX_FULL: Set when the receive buffer reaches or goes above the RX_TL threshold in the
 *                      IC_RX_TL register
 *                    - I2C_INT_RX_OVER: Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an
 *                      additional byte is received from an external I2C device.
 *                    - I2C_INT_RX_UNDER: Set if the processor attempts to read the receive buffer when it is empty by reading.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void I2C0_Handler(void)
 * {
 *     if (I2C_GetINTStatus(I2C0, I2C_INT_STOP_DET) == SET)
 *     {
 *         //Add user code here.
 *         I2C_ClearINTPendingBit(I2C0, I2C_INT_STOP_DET);
 *     }
 * }
 * \endcode
 */
void I2C_ClearINTPendingBit(I2C_TypeDef *I2Cx, uint16_t I2C_IT);

/**
 * \brief   Set slave device address.
 *
 * \param[in] I2Cx     Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] Address  Specify the slave address which will be transmitte.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     I2C_SetSlaveAddress(I2C0, 0x55);
 * }
 * \endcode
 */
void I2C_SetSlaveAddress(I2C_TypeDef *I2Cx, uint16_t Address);

/**
 * \brief   Write command through the I2Cx peripheral.
 *
 * \param[in] I2Cx       Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] command    Command of write or read.
 *                       \arg I2C_READ_CMD: Read command. Data which want to transmit can be 0 in this situation.
 *                       \arg I2C_WRITE_CMD: Write command.
 * \param[in] data       Data which to be transmitted.
 * \param[in] StopState  Whether to send a stop signal.
 *                       - ENABLE: Send stop signal.
 *                       - DISABLE: Do not send stop signal.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     I2C_SendCmd(I2C0, 0x01, 0xAA, ENABLE);
 * }
 * \endcode
 */
void I2C_SendCmd(I2C_TypeDef *I2Cx, I2CSendCommend_TypeDef command, uint8_t data,
                 FunctionalState StopState);

/**
 * \brief  Received data by the I2Cx peripheral.
 *
 * \param[in] I2Cx  Select the I2C peripheral. Refer to \ref I2C_Declaration.
 *
 * \return Return the most recent received data.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     uint8_t data = I2C_ReceiveData(I2C0);
 * }
 * \endcode
 */
uint8_t I2C_ReceiveData(I2C_TypeDef *I2Cx);

/**
 * \brief   Get data length in Rx FIFO of the I2Cx peripheral.
 *
 * \param[in] I2Cx  Select the I2C peripheral. Refer to \ref I2C_Declaration.
 *
 * \return  Current data number in Rx FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     uint8_t data_len = I2C_GetRxFIFOLen(I2C0);
 * }
 * \endcode
 */
uint8_t I2C_GetRxFIFOLen(I2C_TypeDef *I2Cx);

/**
 * \brief   Get data length in Tx FIFO of the I2Cx peripheral.
 *
 * \param[in] I2Cx  Select the I2C peripheral. Refer to \ref I2C_Declaration.
 *
 * \return  Current data number in Tx FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     uint8_t data_len = I2C_GetTxFIFOLen(I2C0);
 * }
 * \endcode
 */
uint8_t I2C_GetTxFIFOLen(I2C_TypeDef *I2Cx);

/**
 * \brief   Clear all I2C interrupt.
 *
 * \param[in] I2Cx  Select the I2C peripheral. Refer to \ref I2C_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     I2C_ClearAllINT(I2C0);
 * }
 * \endcode
 */
void I2C_ClearAllINT(I2C_TypeDef *I2Cx);

/**
 * \brief  Get the specified I2C flag status.
 *
 * \param[in] I2Cx      Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] I2C_FLAG  Specify the flag to check.
 *                      This parameter can be one of the following values, refer to \ref I2C_Flags.
 *                      - I2C_FLAG_SLV_HOLD_RX_FIFO_FULL: The BUS hold in Slave mode due to the RX FIFO being Full and an additional byte being received.
 *                      - I2C_FLAG_SLV_HOLD_TX_FIFO_EMPTY: The BUS hold in Slave mode for the read request when the TX FIFO is empty.
 *                      - I2C_FLAG_MST_HOLD_RX_FIFO_FULL: The BUS hold in Master mode due to TX FIFO is full and additional byte has been received.
 *                      - I2C_FLAG_MST_HOLD_TX_FIFO_EMPTY: The BUS hold when the master holds the bus because of the TX FIFO being empty.
 *                      - I2C_FLAG_SLV_ACTIVITY: Slave FSM activity status.
 *                      - I2C_FLAG_MST_ACTIVITY: Master FSM activity status.
 *                      - I2C_FLAG_RFF: Receive FIFO completely full.
 *                      - I2C_FLAG_RFNE: Receive FIFO not empty.
 *                      - I2C_FLAG_TFE: Transmit FIFO completely empty.
 *                      - I2C_FLAG_TFNF: Transmit FIFO not full.
 *                      - I2C_FLAG_ACTIVITY: I2C activity status.
 *
 * \return  The status of I2C flag.
 *          - SET: The I2C flag has been set.
 *          - RESET: The I2C flag has been reset.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     FlagStatus flag_status = I2C_GetFlagState(I2C0, I2C_FLAG_RFF);
 * }
 * \endcode
 */
FlagStatus I2C_GetFlagState(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);

