yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/i2c/inc/rtl_i2c.h
/**
 * \brief  Check whether the last I2Cx event is equal to the one passed as parameter.
 *
 * \param[in] I2Cx       Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] I2C_EVENT  Specify the event to be checked about I2C Transmit Abort Status Register.
 *                       This parameter can be one of the following values, refer to \ref I2C_Transmit_Abort_Source.
 *                       - ABRT_SLVRD_INTX: When the processor side responds to a slave mode request for data to be transmitted to a remote master and user send read command.
 *                       - ABRT_SLV_ARBLOST: Slave lost the bus while transmitting data to a remote master.
 *                       - ABRT_SLVFLUSH_TXFIFO: Slave has received a read command and some data exists in the TX FIFO so the slave issues a TX_ABRT interrupt to flush old data in TX FIFO.
 *                       - ARB_LOST: Master has lost arbitration or the slave transmitter has lost arbitration.
 *                       - ABRT_MASTER_DIS: User tries to initiate a Master operation with the Master mode disabled
 *                       - ABRT_10B_RD_NORSTRT: The restart is disabled and the master sends a read command in 10-bit addressing mode.
 *                       - ABRT_SBYTE_NORSTRT: The restart is disabled and the user is trying to send a START Byte.
 *                       - ABRT_HS_NORSTRT: The restart is disabled and the user is trying to use the master to transfer data in High Speed mode.
 *                       - ABRT_SBYTE_ACKDET: Master has sent a START Byte and the START Byte was acknowledged (wrong behavior).
 *                       - ABRT_HS_ACKDET: Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior).
 *                       - ABRT_GCALL_READ: Sent a General Call but the user programmed the byte following the General Call to be a read from the bus.
 *                       - ABRT_GCALL_NOACK: Sent a General Call and no slave on the bus acknowledged the General Call.
 *                       - ABRT_TXDATA_NOACK: Master sent data byte(s) following the address, it did not receive an acknowledge from the remote slave.
 *                       - ABRT_10ADDR2_NOACK: Master is in 10-bit address mode and the second address byte of the 10-bit address was not acknowledged by any slave.
 *                       - ABRT_10ADDR1_NOACK: Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.
 *                       - ABRT_7B_ADDR_NOACK: Master is in 7-bit addressing mode and the address sent was not acknowledged by any slave.
 *
 * \return  An ErrorStatus enumeration value.
 *          - SUCCESS: Last event is equal to the I2C_EVENT.
 *          - ERROR: Last event is different from the I2C_EVENT.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     FlagStatus flag_status = I2C_CheckEvent(I2C0, ABRT_SLVRD_INTX);
 * }
 * \endcode
 */
FlagStatus I2C_CheckEvent(I2C_TypeDef *I2Cx, uint32_t I2C_EVENT);

/**
 * \brief   Get the specified I2C interrupt status.
 *
 * \param[in] I2Cx    Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] I2C_IT  This parameter can be one of the following values, refer to \ref I2C_Interrupts.
 *                    \arg I2C_INT_MST_ON_HOLD: Indicates whether a master is holding the bus.
 *                    \arg I2C_INT_GEN_CALL: Set only when a General Call address is received and it is acknowledged.
 *                    \arg I2C_INT_START_DET: Indicates whether a START or RESTART condition has occurred on the I2C
 *                         interface regardless of whether DW_apb_i2c is operating in slave or master mode.
 *                    \arg I2C_INT_STOP_DET: Indicates whether a STOP condition has occurred on the I2C interface regardless
 *                         of whether DW_apb_i2c is operating in slave or master mode
 *                    \arg I2C_INT_ACTIVITY: This bit captures DW_apb_i2c activity and stays set until it is cleared.
 *                    \arg I2C_INT_RX_DONE: When the DW_apb_i2c is acting as a slave-transmitter, this bit is set to 1 if the
 *                         master does not acknowledge a transmitted byte. This occurs on the last byte of
 *                         the transmission, indicating that the transmission is done.
 *                    \arg I2C_INT_TX_ABRT: This bit indicates if DW_apb_i2c, as an I2C transmitter, is unable to complete the
 *                         intended actions on the contents of the transmit FIFO.
 *                    \arg I2C_INT_RD_REQ: This bit is set to 1 when acting as a slave and another I2C master
 *                         is attempting to read data.
 *                    \arg I2C_INT_TX_EMPTY: This bit is set to 1 when the transmit buffer is at or below the threshold value set
 *                         in the IC_TX_TL register.
 *                    \arg I2C_INT_TX_OVER: Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and
 *                         the processor attempts to issue another I2C command.
 *                    \arg I2C_INT_RX_FULL: Set when the receive buffer reaches or goes above the RX_TL threshold in the
 *                         IC_RX_TL register
 *                    \arg I2C_INT_RX_OVER: Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an
 *                         additional byte is received from an external I2C device.
 *                    \arg I2C_INT_RX_UNDER: Set if the processor attempts to read the receive buffer when it is empty by reading.
 *
 * \return  The status of I2C interrupt.
 *          - SET: The I2C interrupt has been set.
 *          - RESET: The I2C interrupt has been reset.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     ITStatus int_status = I2C_GetINTStatus(I2C0, I2C_INT_RD_REQ);
 * }
 * \endcode
 */
ITStatus I2C_GetINTStatus(I2C_TypeDef *I2Cx, uint32_t I2C_IT);

/**
 * \brief   Enable or disable the I2Cx GDMA interface.
 *
 * \param[in] I2Cx         Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] I2C_GDMAReq  Specify the I2C GDMA transfer request to be enabled or disabled.
 *                         This parameter can be one of the following values:
 *                         \arg I2C_GDMAReq_Tx: Tx buffer GDMA transfer request.
 *                         \arg I2C_GDMAReq_Rx: Rx buffer GDMA transfer request.
 * \param[in] NewState     New state of the selected I2C GDMA transfer request.
 *                         This parameter can be one of the following values:
 *                         \arg ENABLE: Enable the I2Cx GDMA interface.
 *                         \arg DISABLE: Disable the I2Cx GDMA interface.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c0_demo(void)
 * {
 *     I2C_GDMACmd(I2C0, I2C_GDMAReq_Tx, ENABLE);
 * }
 * \endcode
 */
void I2C_GDMACmd(I2C_TypeDef *I2Cx, I2CGdmaTransferRequests_TypeDef I2C_GDMAReq,
                 FunctionalState NewState);

/**
 * \brief   Set the I2C clock speed, the function need to be called when I2C disabled.
 *
 * \param[in] I2Cx            Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] I2C_ClockSpeed  Specify the I2C clock speed.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2c_demo(void)
 * {
 *     I2C_SetClockSpeed(I2C0, 400000);
 * }
 * \endcode
 */
void I2C_SetClockSpeed(I2C_TypeDef *I2Cx, uint32_t I2C_ClockSpeed);

/**
 * \brief  I2C clock divider config.
 *
 * \param[in] I2Cx      Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[in] ClockDiv  Specify the I2C clock divider.
 *                      This parameter can refer to \ref I2C_Clock_Divider.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_i2c_init(void)
 * {
 *     I2C_ClkDivConfig(I2C0, I2C_CLOCK_DIVIDER_1);
 * }
 * \endcode
 */
void I2C_ClkDivConfig(I2C_TypeDef *I2Cx, I2CClockDiv_TypeDef ClockDiv);

/**
 * \brief  Get I2C clock divider.
 *
 * \param[in] I2Cx       Select the I2C peripheral. Refer to \ref I2C_Declaration.
 * \param[out] ClockSrc  Specify the clock source to gates its clock.
 * \param[out] ClockDiv  Specify the I2C clock divider.
 *                       This parameter can refer to \ref I2C_Clock_Divider.
 *
 * \return The status of get clock.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_i2c_init(void)
 * {
 *     I2C_ClkGet(I2C0, I2C_CLOCK_SRC,I2C_CLOCK_DIVIDER_1);
 * }
 * \endcode
 */
bool I2C_ClkGet(I2C_TypeDef *I2Cx, I2CClockSrc_TypeDef *ClockSrc, I2CClockDiv_TypeDef *ClockDiv);


#if (I2C_SUPPORT_RAP_FUNCTION == 1)
void I2C_WrapperModeCmd(I2C_TypeDef *I2Cx, FunctionalState NewState);

bool I2C_WrapperTransModeSet(I2C_TypeDef *I2Cx, uint32_t mode);

void I2C_WrapperWriteDataSet(I2C_TypeDef *I2Cx, uint8_t num, const uint8_t *buf);

uint8_t I2C_WrapperGetTxFIFOLen(I2C_TypeDef *I2Cx);

void I2C_WrapperTxFIFOClear(I2C_TypeDef *I2Cx);

void I2C_WrapperReadNumSet(I2C_TypeDef *I2Cx, uint16_t num);

uint8_t I2C_WrapperReceiveData(I2C_TypeDef *I2Cx);

uint8_t I2C_WrapperGetRxFIFOLen(I2C_TypeDef *I2Cx);

void I2C_WrapperTransStart(I2C_TypeDef *I2Cx);

bool I2C_WrapperBusyCheck(I2C_TypeDef *I2Cx);

void I2C_RAPModeCmd(I2C_TypeDef *I2Cx, FunctionalState NewState);

void I2C_TaskTrigger(I2C_TypeDef *I2Cx, uint32_t Task);

#endif


/** End of I2C_Exported_Functions
  * \}
  */

/** End of I2C
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /*RTL_I2C_H*/


